In [3]:
import pandas as pd

## 1. Import Data

In [4]:
df = pd.read_csv('imdb-videogames.csv')

# 2. Inspect a portion of the dataset

In [5]:
df.head()

,Unnamed: 0,name,url,year,certificate,rating,votes,plot summary,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
0,0,Spider-Man,https://www.imdb.com/title/tt5807780/?ref_=adv...,2018.0,T,9.2,"20,759","When a new villain threatens New York City, Pe...",True,True,False,False,False,True,False,False,False
1,1,Red Dead Redemption II,https://www.imdb.com/title/tt6161168/?ref_=adv...,2018.0,M,9.7,"35,703",Amidst the decline of the Wild West at the tur...,True,True,False,True,False,False,False,False,False
2,2,Grand Theft Auto V,https://www.imdb.com/title/tt2103188/?ref_=adv...,2013.0,M,9.5,"59,986",Three very different criminals team up for a s...,True,False,False,True,False,False,False,False,False
3,3,God of War,https://www.imdb.com/title/tt5838588/?ref_=adv...,2018.0,M,9.6,"26,118","After wiping out the gods of Mount Olympus, Kr...",True,True,False,False,False,False,False,False,False
4,4,Uncharted 4: A Thief's End,https://www.imdb.com/title/tt3334704/?ref_=adv...,2016.0,T,9.5,"28,722",Thrown back into the dangerous underworld he'd...,True,True,False,False,False,False,False,False,False

#convert votes to numeric data type

In [6]:
df.tail(10)

,Unnamed: 0,name,url,year,certificate,rating,votes,plot summary,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
20795,20793,Boku wa kyoumo kimi o korosu,https://www.imdb.com/title/tt6010652/?ref_=adv...,2016.0,NaN,NaN,NaN,Add a Plot,False,False,False,False,False,False,False,False,True
20796,20794,Find Me Event,https://www.imdb.com/title/tt2619050/?ref_=adv...,2011.0,NaN,NaN,NaN,"Days after being kidnapped and tortured, Denni...",False,False,False,False,False,False,False,False,True
20797,20795,Spooks,https://www.imdb.com/title/tt4965776/?ref_=adv...,2017.0,NaN,NaN,NaN,Add a Plot,False,False,False,False,False,False,False,False,True
20798,20796,Bite Marks,https://www.imdb.com/title/tt2797224/?ref_=adv...,2012.0,NaN,NaN,NaN,A demonologist gets in over his head while mak...,False,False,False,False,False,False,False,False,False
20799,20797,Requiem,https://www.imdb.com/title/tt4396968/?ref_=adv...,2016.0,NaN,NaN,NaN,Add a Plot,False,False,False,False,False,False,False,False,True
20800,20798,"Enjoy Your Power, Enjoy Your Choice",https://www.imdb.com/title/tt3845606/?ref_=adv...,2014.0,NaN,NaN,NaN,Add a Plot,False,False,False,False,False,False,False,False,True
20801,20799,RedSun2020,https://www.imdb.com/title/tt0790739/?ref_=adv...,2004.0,NaN,NaN,NaN,Joseph gets kidnapped and it's the player's jo...,False,False,False,False,False,False,False,False,True
20802,20800,Shutter,https://www.imdb.com/title/tt5119948/?ref_=adv...,2015.0,NaN,NaN,NaN,A tech support man who uses a drone to investi...,False,False,False,False,False,False,False,False,True
20803,20801,The Music Machine,https://www.imdb.com/title/tt5142082/?ref_=adv...,2015.0,NaN,NaN,NaN,A young teenage girl and the ghost of a dead m...,False,False,False,False,False,False,False,False,True
20804,20802,Cryptic,https://www.imdb.com/title/tt10964974/?ref_=ad...,2020.0,NaN,NaN,NaN,Kidnapped by an insane man and dragged into a ...,False,False,False,False,False,False,False,False,True

# 3. Shape and Basic Info about the dataset

In [7]:
df.shape

(20805, 17)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20805 entries, 0 to 20804
Data columns (total 17 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    20805 non-null  int64
 1   name          20805 non-null  object
 2   url           20805 non-null  object
 3   year          20538 non-null  float64
 4   certificate   7905 non-null   object
 5   rating        11602 non-null  object
 6   votes         11602 non-null  object
 7   plot summary  20805 non-null  object
 8   Action        20805 non-null  bool
 9   Adventure     20805 non-null  bool
 10  Comedy        20805 non-null  bool
 11  Crime         20805 non-null  bool
 12  Family        20805 non-null  bool
 13  Fantasy       20805 non-null  bool
 14  Mystery       20805 non-null  bool
 15  Sci-Fi        20805 non-null  bool
 16  Thriller      20805 non-null  bool
dtypes: bool(9), float64(1), int64(1), object(6)
memory usage: 1.4+ MB

In [9]:
df.Stars.unique()

AttributeError: 'DataFrame' object has no attribute 'Stars'

# 4. Look for Duplicates

In [ ]:
df.duplicated().sum()

5

In [ ]:
df.drop_duplicates(inplace=True)
df

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
6,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN
7,2578,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
8,2577,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
9,2576,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN
...,...,...,...,...,...,...,...
2580,5,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.5,NaN
2581,4,Wai Wai,Oriental Style Instant Noodles,Pack,Thailand,1,NaN
2582,3,Wai Wai,Tom Yum Shrimp,Pack,Thailand,2,NaN
2583,2,Wai Wai,Tom Yum Chili Flavor,Pack,Thailand,2,NaN
2584,1,Westbrae,Miso Ramen,Pack,USA,0.5,NaN

# 5. Fix Types

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2580 entries, 0 to 2584
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Review #  2580 non-null   int64
 1   Brand     2580 non-null   object
 2   Variety   2580 non-null   object
 3   Style     2578 non-null   object
 4   Country   2580 non-null   object
 5   Stars     2580 non-null   object
 6   Top Ten   41 non-null     object
dtypes: int64(1), object(6)
memory usage: 161.2+ KB

In [ ]:
df[ df.Stars=="Unrated"]
df.Stars.replace("Unrated", 0, inplace=True)

df[ df.Stars=="Unrated"]

Empty DataFrame
Columns: [Review #, Brand, Variety, Style, Country, Stars, Top Ten]
Index: []

In [ ]:
# method 1
df.Stars = pd.to_numeric(df.Stars)

# method 2
df.Stars.astype(float)

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2580 entries, 0 to 2584
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Review #  2580 non-null   int64
 1   Brand     2580 non-null   object
 2   Variety   2580 non-null   object
 3   Style     2578 non-null   object
 4   Country   2580 non-null   object
 5   Stars     2580 non-null   float64
 6   Top Ten   41 non-null     object
dtypes: float64(1), int64(1), object(5)
memory usage: 161.2+ KB

# 6. Summarise Numeric Columns

In [ ]:
df.describe()

          Review #        Stars
count  2580.000000  2580.000000
mean   1290.500000     3.650426
std     744.926171     1.022358
min       1.000000     0.000000
25%     645.750000     3.250000
50%    1290.500000     3.750000
75%    1935.250000     4.250000
max    2580.000000     5.000000

# 7. Summarise Categorical Columns

In [ ]:
df.columns

Index(['Review #', 'Brand', 'Variety', 'Style', 'Country', 'Stars', 'Top Ten'], dtype='object')

In [ ]:
df.Brand.value_counts()

Nissin              381
Nongshim             98
Maruchan             76
Mama                 71
Paldo                66
                   ...
Boss                  1
One Dish Asia         1
Crystal Noodle        1
Jackpot Teriyaki      1
Tao Kae Noi           1
Name: Brand, Length: 355, dtype: int64

In [ ]:
df.Variety.value_counts()

Chicken                                                             7
Beef                                                                7
Artificial Chicken                                                  6
Vegetable                                                           6
Yakisoba                                                            6
                                                                   ..
Penang Hokkien Prawn Noodle (New Improved Taste)                    1
Spaghetti                                                           1
Black Eyes Bean Purple Sweet Potato Noodle With Spicy Miso Sauce    1
Chacharoni                                                          1
Raoh Tantanmen                                                      1
Name: Variety, Length: 2413, dtype: int64

In [ ]:
df.Country.value_counts()

Japan            352
USA              323
South Korea      309
Taiwan           224
Thailand         191
China            169
Malaysia         156
Hong Kong        137
Indonesia        126
Singapore        109
Vietnam          108
UK                69
Philippines       47
Canada            41
India             31
Germany           27
Mexico            25
Australia         22
Netherlands       15
Myanmar           14
Nepal             14
Hungary            9
Pakistan           9
Bangladesh         7
Colombia           6
Cambodia           5
Brazil             5
Poland             4
Holland            4
Fiji               4
Sweden             3
Finland            3
Dubai              3
Sarawak            3
Ghana              2
Estonia            2
United States      1
Nigeria            1
Name: Country, dtype: int64

In [ ]:
df[df.Country == "United States"]

df.loc[578, "Country"] = "USA"

df[df.Country == "United States"]

Empty DataFrame
Columns: [Brand, Variety, Style, Country, Stars, Top Ten]
Index: []

# 8. Drop and Rename Columns

In [ ]:
df.columns

Index(['Review #', 'Brand', 'Variety', 'Style', 'Country', 'Stars', 'Top Ten'], dtype='object')

In [ ]:
df = df.drop("Review #", axis=1)
df

,Brand,Variety,Style,Country,Stars,Top Ten
0,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
6,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1.00,NaN
7,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25,NaN
8,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75,NaN
9,Ching's Secret,Singapore Curry,Pack,India,3.75,NaN
...,...,...,...,...,...,...
2580,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.50,NaN
2581,Wai Wai,Oriental Style Instant Noodles,Pack,Thailand,1.00,NaN
2582,Wai Wai,Tom Yum Shrimp,Pack,Thailand,2.00,NaN
2583,Wai Wai,Tom Yum Chili Flavor,Pack,Thailand,2.00,NaN
2584,Westbrae,Miso Ramen,Pack,USA,0.50,NaN

In [ ]:
df.columns

Index(['Brand', 'Variety', 'Style', 'Country', 'Stars', 'Top Ten'], dtype='object')

In [ ]:
df.columns = ['Brand', 'Variety', 'Style', 'Country', 'Stars', 'TopTen']

# 9. Deal with Nulls

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2580 entries, 0 to 2584
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Brand    2580 non-null   object
 1   Variety  2580 non-null   object
 2   Style    2578 non-null   object
 3   Country  2580 non-null   object
 4   Stars    2580 non-null   float64
 5   TopTen   41 non-null     object
dtypes: float64(1), object(5)
memory usage: 221.1+ KB

In [ ]:
df.TopTen.value_counts()

\n          4
2012 #3     1
2012 #1     1
2013 #4     1
2013 #2     1
2015 #4     1
2012 #4     1
2014 #8     1
2015 #1     1
2013 #3     1
2016 #1     1
2014 #4     1
2012 #5     1
2015 #9     1
2016 #7     1
2014 #9     1
2014 #6     1
2016 #10    1
2012 #6     1
2012 #9     1
2012 #10    1
2015 #7     1
2016 #5     1
2012 #7     1
2013 #1     1
2014 #7     1
2013 #9     1
2016 #9     1
2015 #8     1
2016 #8     1
2012 #2     1
2014 #1     1
2014 #5     1
2013 #6     1
2013 #10    1
2015 #6     1
2014 #10    1
2015 #10    1
Name: TopTen, dtype: int64

In [ ]:
df.TopTen.fillna(0, inplace=True)

In [12]:
df.Style.value_counts()

AttributeError: 'DataFrame' object has no attribute 'Style'

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2580 entries, 0 to 2584
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Brand    2580 non-null   object
 1   Variety  2580 non-null   object
 2   Style    2578 non-null   object
 3   Country  2580 non-null   object
 4   Stars    2580 non-null   float64
 5   TopTen   2580 non-null   object
dtypes: float64(1), object(5)
memory usage: 221.1+ KB

In [13]:
df.Style.info()

AttributeError: 'DataFrame' object has no attribute 'Style'

# 10. Group and Order